{
  "⏳ Опоздание": [
    {
      "title": "Опоздание - Эмпатия",
      "text": "Простите за опоздание, понимаю, что вы рассчитывали на своевременную доставку. Мне очень жаль, что вы не получили заказ вовремя. Я проверю информацию по заказу и сразу к вам вернусь."
    },
    {
      "title": "Безвыходная ситуация",
      "text": "Уточнил информацию: на точке действительно очень большая нагрузка, и на данный момент нет свободных курьеров, которые могли бы взять ваш заказ в работу. Как только появится свободный сотрудник, мы сразу же возьмёмся за доставку вашего заказа. Как клиент, я понимаю, что эта ситуация крайне неприемлема.\n\nСейчас мы вызываем дополнительных сотрудников, чтобы как можно скорее разрешить эту ситуацию. Делаем всё, что в наших силах.\n\nЕсли вам будет удобно, могу предложить перенести заказ на следующий день в любой интервал с XX до XX, когда нагрузка не будет столь критичной. Тогда наши партнёры смогут доставить вам заказ без опоздания. От себя я бы действительно посоветовал этот вариант, так как нагрузка действительно очень большая, и я бы не хотел заставлять вас ждать ещё больше."
    },
    {
      "title": "Магазин близко, почему опаздываете?",
      "text": "[ИМЯ], понимаю, как вы рассчитывали на покупки, это крайне неприемлемо, что вам их ещё не привезли. К сожалению, опоздание заказа не всегда связано с тем, что адрес доставки находится далеко от магазина. В период, когда количество заказов резко увеличивается, сборщики и курьеры не успевают собирать и доставлять заказы вовремя. Простите нас, это ни в коем случае не оправдывает опоздание вашего заказа. Сейчас я выясню, что с вашим заказом и когда его смогут доставить."
    },
    {
      "title": "Многократные переносы по опозданию",
      "text": "[ИМЯ], простите, пожалуйста, что вам не в первый раз пришлось столкнуться с такой неприятной ситуацией. Это наша ошибка, мы действительно не смогли справиться с нагрузкой, несмотря на все приложенные усилия. Мы обязательно наладим своевременную доставку. Очень надеюсь, что вы простите нас, пройдёте с нами этот сложный этап и вернётесь за покупками, зная, что наш сервис стремится сделать вашу жизнь проще и удобнее."
    },
    {
      "title": "Зачем принимаете заказы, если не справляетесь с нагрузкой?",
      "text": "[ИМЯ], простите, пожалуйста, за опоздание. К сожалению, нагрузка на сервис увеличилась внепланово. Это действительно наша ошибка, мы обязательно сделаем выводы и предпримем действия, чтобы сделать сервис доступным при любых обстоятельствах.\n\nУже сейчас мы прикладываем все силы для того, чтобы в кратчайшие сроки расширить команду сборщиков и курьеров и доставлять все полученные заказы вовремя."
    },
    {
      "title": "32",
      "text": "123123"
    }
  ],
  "👋 Приветствие": [
    {
      "title": "Стандартное приветствие",
      "text": "Здравствуйте! Изучаю ваш вопрос, скоро вернусь."
    }
  ],
  "👋 Прощание": [
    {
      "title": "Прощание - Android/Desktop",
      "text": "Мы постараемся сделать всё, чтобы больше вас не расстраивать. Если у вас появятся ещё вопросы, обращайтесь снова. Всего вам самого доброго!\nЕсли придёт сообщение с просьбой оценить консультацию, буду благодарен за оценку."
    }
  ],
  "⌚ Ожидание": [
    {
      "title": "Холд - большая нагрузка",
      "text": "ИМЯ, большое спасибо за длительное ожидание. Примите мои извинения за столь долгий ответ. В данный момент поступает большое количество обращений, из-за чего время ответа увеличивается."
    }
  ]
}